In [119]:
import pandas as pd
import numpy as np
import os
pd.__version__

'2.2.2'

In [120]:
root_dir = os.path.dirname(os.getcwd())
data_dir = os.path.join(root_dir, 'data')
data_set_path = os.path.join(data_dir, 'sales_subset.csv')

In [121]:
"""Read File"""
sales = pd.read_csv(data_set_path)
sales = sales.drop(columns=['Unnamed: 0'])
sales.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [122]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10774 entries, 0 to 10773
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   store                 10774 non-null  int64
 1   type                  10774 non-null  object
 2   department            10774 non-null  int64
 3   date                  10774 non-null  object
 4   weekly_sales          10774 non-null  float64
 5   is_holiday            10774 non-null  bool
 6   temperature_c         10774 non-null  float64
 7   fuel_price_usd_per_l  10774 non-null  float64
 8   unemployment          10774 non-null  float64
dtypes: bool(1), float64(4), int64(2), object(2)
memory usage: 684.0+ KB

In [123]:
"""Methods"""
weekly_sales_avg = sales['weekly_sales']

In [124]:
"""Mean"""
print('Mean: ',weekly_sales_avg.mean())

Mean:  23843.95014850566

In [125]:
"""Max"""
print('Max: ',weekly_sales_avg.max())

Max:  293966.05

In [126]:
"""Min"""
print('Min: ',weekly_sales_avg.min())

Min:  -1098.0

In [127]:
"""Sum"""
print('Sum: ',weekly_sales_avg.sum())

Sum:  256894718.89999998

In [128]:
"""Median"""
print('Median: ',weekly_sales_avg.median())

Median:  12049.064999999999

In [129]:
"""cumulative sum"""
print('Cumulative Sum: ',weekly_sales_avg.cumsum())

Cumulative Sum:  0        2.492450e+04
1        4.675240e+04
2        1.040108e+05
3        1.214248e+05
4        1.389829e+05
             ...
10769    2.568930e+08
10770    2.568934e+08
10771    2.568938e+08
10772    2.568938e+08
10773    2.568947e+08
Name: weekly_sales, Length: 10774, dtype: float64

In [130]:
"""Used Multiple Columns"""
sales[['weekly_sales', 'fuel_price_usd_per_l']].mean()

weekly_sales            23843.950149
fuel_price_usd_per_l        0.749746
dtype: float64

In [131]:
"""Aggregate  Function"""
sales[['weekly_sales', 'temperature_c', 'fuel_price_usd_per_l']].agg([np.max, np.min, np.sum, np.mean, np.median])

C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\2730766756.py:2: FutureWarning: The provided callable <function max at 0x0000018F551102C0> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sales[['weekly_sales', 'temperature_c', 'fuel_price_usd_per_l']].agg([np.max, np.min, np.sum, np.mean, np.median])
C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\2730766756.py:2: FutureWarning: The provided callable <function min at 0x0000018F55110400> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sales[['weekly_sales', 'temperature_c', 'fuel_price_usd_per_l']].agg([np.max, np.min, np.sum, np.mean, np.median])
C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\2730766756.py:2: FutureWarning: The provided callable <function sum at 0x0000018F550E3BA0> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  sales[['weekly_sales', 'temperature_c', 'fuel_price_usd_per_l']].agg([np.max, np.min, np.sum, np.mean, np.median])
C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\2730766756.py:2: FutureWarning: The provided callable <function mean at 0x0000018F55110CC0> is currently using Series.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  sales[['weekly_sales', 'temperature_c', 'fuel_price_usd_per_l']].agg([np.max, np.min, np.sum, np.mean, np.median])
C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\2730766756.py:2: FutureWarning: The provided callable <function median at 0x0000018F55254900> is currently using Series.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  sales[['weekly_sales', 'temperature_c', 'fuel_price_usd_per_l']].agg([np.max, np.min, np.sum, np.mean, np.median])

        weekly_sales  temperature_c  fuel_price_usd_per_l
max     2.939660e+05      33.827778              1.107674
min    -1.098000e+03      -8.366667              0.664129
sum     2.568947e+08  169496.333333           8077.761722
mean    2.384395e+04      15.731978              0.749746
median  1.204906e+04      16.966667              0.743381

In [132]:
"""Categorical Values"""
sales['type'].value_counts()

type
A    9872
B     902
Name: count, dtype: int64

In [133]:
sales['store'].value_counts(ascending=True)

store
39    875
14    885
31    890
6     894
2     897
27    900
1     901
4     901
10    902
19    906
20    910
13    913
Name: count, dtype: int64

In [134]:
"""Group by"""
sales_grouped_by = sales.groupby(['type'])
sales_grouped_by[['weekly_sales']].sum()

      weekly_sales
type
A     2.337163e+08
B     2.317840e+07

In [135]:
sales_by_type_holiday = sales.groupby(['type', 'is_holiday'])
sales_by_type_holiday[['weekly_sales']].sum()

                 weekly_sales
type is_holiday
A    False       2.336927e+08
     True        2.360181e+04
B    False       2.317678e+07
     True        1.621410e+03

In [136]:
sales_grouped_by_weekly = sales.groupby("type")['weekly_sales'].agg([np.min, np.max, np.sum, np.mean, np.median])
sales_grouped_by_weekly

C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\4114064010.py:1: FutureWarning: The provided callable <function min at 0x0000018F55110400> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sales_grouped_by_weekly = sales.groupby("type")['weekly_sales'].agg([np.min, np.max, np.sum, np.mean, np.median])
C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\4114064010.py:1: FutureWarning: The provided callable <function max at 0x0000018F551102C0> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sales_grouped_by_weekly = sales.groupby("type")['weekly_sales'].agg([np.min, np.max, np.sum, np.mean, np.median])
C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\4114064010.py:1: FutureWarning: The provided callable <function sum at 0x0000018F550E3BA0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  sales_grouped_by_weekly = sales.groupby("type")['weekly_sales'].agg([np.min, np.max, np.sum, np.mean, np.median])
C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\4114064010.py:1: FutureWarning: The provided callable <function mean at 0x0000018F55110CC0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  sales_grouped_by_weekly = sales.groupby("type")['weekly_sales'].agg([np.min, np.max, np.sum, np.mean, np.median])
C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\4114064010.py:1: FutureWarning: The provided callable <function median at 0x0000018F55254900> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  sales_grouped_by_weekly = sales.groupby("type")['weekly_sales'].agg([np.min, np.max, np.sum, np.mean, np.median])

         min        max           sum          mean    median
type
A    -1098.0  293966.05  2.337163e+08  23674.667242  11943.92
B     -798.0  232558.51  2.317840e+07  25696.678370  13336.08

In [137]:
"""Pivot Table"""
sales.head()
sales.pivot_table(
    values=['weekly_sales', 'fuel_price_usd_per_l'],
    index=['type'],
    aggfunc=[np.sum, np.max, np.min, np.mean, np.std]
)

C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\2470836337.py:3: FutureWarning: The provided callable <function sum at 0x0000018F550E3BA0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  sales.pivot_table(
C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\2470836337.py:3: FutureWarning: The provided callable <function max at 0x0000018F551102C0> is currently using DataFrameGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sales.pivot_table(
C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\2470836337.py:3: FutureWarning: The provided callable <function min at 0x0000018F55110400> is currently using DataFrameGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sales.pivot_table(
C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\2470836337.py:3: FutureWarning: The provided callable <function mean at 0x0000018F55110CC0> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  sales.pivot_table(
C:\Users\Asus\AppData\Local\Temp\ipykernel_12868\2470836337.py:3: FutureWarning: The provided callable <function std at 0x0000018F55110E00> is currently using DataFrameGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  sales.pivot_table(

                      sum                                max               \
     fuel_price_usd_per_l  weekly_sales fuel_price_usd_per_l weekly_sales
type
A             7350.877448  2.337163e+08             1.107410    293966.05
B              726.884274  2.317840e+07             1.107674    232558.51

                      min                              mean                \
     fuel_price_usd_per_l weekly_sales fuel_price_usd_per_l  weekly_sales
type
A                0.664129      -1098.0             0.744619  23674.667242
B                0.760023       -798.0             0.805858  25696.678370

                      std
     fuel_price_usd_per_l  weekly_sales
type
A                0.058674  30129.407656
B                0.034115  31155.867745

In [138]:
data_set_path = os.path.join(data_dir, 'temperatures.csv')
temperatures = pd.read_csv(data_set_path)
temperatures

       Unnamed: 0        date     city        country  avg_temp_c
0               0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1               1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2               2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3               3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4               4  2000-05-01  Abidjan  Côte D'Ivoire      27.547
...           ...         ...      ...            ...         ...
16495       16495  2013-05-01     Xian          China      18.979
16496       16496  2013-06-01     Xian          China      23.522
16497       16497  2013-07-01     Xian          China      25.251
16498       16498  2013-08-01     Xian          China      24.528
16499       16499  2013-09-01     Xian          China         NaN

[16500 rows x 5 columns]

In [139]:
temperatures.index

RangeIndex(start=0, stop=16500, step=1)

In [140]:
temperatures_set_by_index_city = temperatures.set_index('city')
temperatures_set_by_index_city.head()

         Unnamed: 0        date        country  avg_temp_c
city
Abidjan           0  2000-01-01  Côte D'Ivoire      27.293
Abidjan           1  2000-02-01  Côte D'Ivoire      27.685
Abidjan           2  2000-03-01  Côte D'Ivoire      29.061
Abidjan           3  2000-04-01  Côte D'Ivoire      28.162
Abidjan           4  2000-05-01  Côte D'Ivoire      27.547

In [141]:
temperatures_set_by_index_city.index

Index(['Abidjan', 'Abidjan', 'Abidjan', 'Abidjan', 'Abidjan', 'Abidjan',
       'Abidjan', 'Abidjan', 'Abidjan', 'Abidjan',
       ...
       'Xian', 'Xian', 'Xian', 'Xian', 'Xian', 'Xian', 'Xian', 'Xian', 'Xian',
       'Xian'],
      dtype='object', name='city', length=16500)

In [142]:
cities=['Xian']
temperatures_set_by_index_city.loc[cities].head()

      Unnamed: 0        date country  avg_temp_c
city
Xian       16335  2000-01-01   China      -2.819
Xian       16336  2000-02-01   China       0.943
Xian       16337  2000-03-01   China       8.997
Xian       16338  2000-04-01   China      13.714
Xian       16339  2000-05-01   China      20.568

In [143]:
temperatures = temperatures.drop(columns=['Unnamed: 0'])
temperatures.head()

         date     city        country  avg_temp_c
0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

In [148]:
print(temperatures.iloc[4,3])

27.547
         date     city        country  avg_temp_c
0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
             country  avg_temp_c
0      Côte D'Ivoire      27.293
1      Côte D'Ivoire      27.685
2      Côte D'Ivoire      29.061
3      Côte D'Ivoire      28.162
4      Côte D'Ivoire      27.547
...              ...         ...
16495          China      18.979
16496          China      23.522
16497          China      25.251
16498          China      24.528
16499          China         NaN

[16500 rows x 2 columns]

In [149]:
print(temperatures.iloc[:3])

         date     city        country  avg_temp_c
0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2  2000-03-01  Abidjan  Côte D'Ivoire      29.061

In [150]:
print(temperatures.iloc[: , 2:4])

             country  avg_temp_c
0      Côte D'Ivoire      27.293
1      Côte D'Ivoire      27.685
2      Côte D'Ivoire      29.061
3      Côte D'Ivoire      28.162
4      Côte D'Ivoire      27.547
...              ...         ...
16495          China      18.979
16496          China      23.522
16497          China      25.251
16498          China      24.528
16499          China         NaN

[16500 rows x 2 columns]

In [151]:
print(temperatures.iloc[:5 , :2])

         date     city
0  2000-01-01  Abidjan
1  2000-02-01  Abidjan
2  2000-03-01  Abidjan
3  2000-04-01  Abidjan
4  2000-05-01  Abidjan